<?php
/**
* Файл локализации базовых переменных
*
* @author Intervision (https://github.com/intervisionlord)
* Copyright © 2019 Intervision
*/

// Меню
define('GOTOMANTIS', 'Открыть Mantis');                           // Строка для ссылки на мантис в меню
define('ABOUTSTRING', 'О программе');                             // Заголовок "О программе" на странице "about"

// Основная форма запроса
define('FILLTHEFORM', 'Заполните форму запроса');                 // Заголовок формы запроса
define('LANG_SELECT_PROJECT', 'Выберите проект');                 // Название поля выбора проекта
define('LANG_SELECT_PROJECT_DESCR', 'По какому проекту вопрос');  // Описание поля выбора проекта
define('LANG_SELECT_CATEGORY', 'Выберите категорию');             // Название поля выбора категории
define('LANG_SELECT_CATEGORY_DESCR', 'Какого типа запрос');       // Описание поля выбора запроса
define('LANG_FORM_TITLE', 'Тема запроса');                        // Название поля темы запроса
define('LANG_FORM_TITLE_DESCR', 'Краткое описание запроса');      // Описание поля темы запроса
define('LANG_FULLTEXT', 'Описание');                              // Название поля ввода основного текста
define('LANG_FULLTEXT_DESCR', 'Подробное описание запроса');      // Описание поля ввода основного текста
define('LANG_EMAIL', 'e-mail');                                   // Название поля ввода email'а
define('LANG_EMAIL_DESCR', 'Если потребуется связаться с Вами');  // Описание поля ввода email'а
define('LANG_EMAIL_PLACEHOLDER', 'email@example.com');            // Заполнитель поля ввода email'а
define('LANG_REQURED', 'Поля, обязательные для заполнения.');     // Поясняющий текст к полям, отмеченным звездочкой
define('LANG_SUBMITBTN', 'Отправить');                            // Текст кнопки "Отправить"

// Локализация в таблице "О программе"
define('LANGSTRING', 'Локализация');                              // Строка "Локализация"
define('LANGVSTR', 'Версия локализации');                         // Строка "Версия локализации"
define('LANG_VERSION', '0.2');                                    // Версия файла локализации
define('LANGTYPE', 'Определение локализации');                    // Строка настройки локализации
define('LOCALEFORCED', 'Локаль определена вручную');              // Локаль выставлена принудительно в настройках
define('LOCALENOTFORCED', 'Локаль определена автоматически');     // Локаль определа автоматически

// Интеграция с Mantis
define('INTEGRATION', 'Интеграция');                              // Строка "Интеграция" в таблице "О программе"
define('MANTISVERSION', 'Версия Mantis');                         // Строка "Версия Mantis" в таблице "О программе"

// Captcha
define('LANG_CAPTCHA_REQUIRED', 'Вы не прошли проверку');         // Текст при отсутствии галочки в каптче

// Прочее
define('WEONGITHUB', 'Страница программы на GitHub');             // Описание ссылки на страницу на гитхабе (alt)
define('ABTVERSIONPARAM', 'Версия программы');                    // Строка "Версия" в таблице "О программе"
