<?php
/**
* Файл локализации базовых переменных
*
* @author Intervision (https://github.com/intervisionlord)
* Copyright © 2019 Intervision
*/

define('NOLANG', 'Отсутствует пакет локализации');            // Сообщение об отсутствии пакета локализации
define('ABOUTSTRING', 'О программе');                         // Заголовок "О программе" на странице "about"
//define('VERSIONSTRING','Версия программы');
define('ABTVERSIONPARAM', 'Версия программы');                // Строка "Версия" в таблице "О программе"
define('GOTOMANTIS', 'Открыть Mantis');                       // Строка для ссылки на мантис в меню
//define('SELECTEDPROJECT', 'Текущий проект: ');              // Заголовок для текущего проекта
define('FILLTHEFORM', 'Заполните форму запроса');             // Заголовок формы запроса

// Локализация

define('LANGSTRING', 'Локализация');                          // Строка "Локализация"
define('LANGVSTR', 'Версия локализации');                     // Строка "Версия локализации"
define('LANG_VERSION', '0.2');                                // Версия файла локализации
define('LANGTYPE', 'Определение локализации');                // Строка настройки локализации
define('LOCALEFORCED', 'Локаль определена вручную');          // Локаль выставлена принудительно в настройках
define('LOCALENOTFORCED', 'Локаль определена автоматически'); // Локаль определа автоматически

// Интеграция с $MANTISVERSION

define('INTEGRATION', 'Интеграция');                          // Строка "Интеграция" в таблице "О программе"
define('MANTISVERSION', 'Версия Mantis');                     // Строка "Версия Mantis" в таблице "О программе"

// Прочее
define('WEONGITHUB', 'Страница программы на GitHub');         // Описание ссылки на страницу на гитхабе (alt)
